export interface Poem {
  id: string;
  title: string;
  poet: string;
  content: string;  // Full poem text
}

export const poems: Poem[] = [
  // Example format - replace with actual poems
  {
    id: '1',
    title: 'אהבנו כאן',
    poet: 'יהודה עמיחי',
    content:`
            אהבנו כאן
            המציאות היתה אחרת
            העיתונים שוב צעקו כמו פצועים
            מאחורי שורות ענק שבכותרת
            אנחנו שנינו נחבאים

            ברדיו
            נאמרו חדשות הערב
            כל המילים יצאו בלי שיבה
            אנשי הזאבים יצאו לטרף
            אנשי הכאבים אל התקווה

            אנשי המרפקים תפסו מקום
            אנשי האהבה חלמו חלום
            נשות התה בכו לתוך כוסות
            מאחורי ההר חיכו גייסות  

            לא שוחררו ממלחמותיהם
            ולא ישובו עוד לבתיהם`
  },
    {
    id: '2',
    title: 'אהבת הארץ',
    poet: 'יהודה עמיחי',
    content:`
           
והארץ מחולקת למחוזות הזיכרון וגלילי התקווה,
ותושביהם מתערבבים אלה עם אלה,
כמו חוזרים מחתונה עם חוזרים מליווית המת.

והארץ לא מחולקת לשיטחי מילחמה ולשיטחי שלום.
ומי שחופר גומה נגד פגזים,
ישוב וישכב בה עם נערתו,
אם יחיה לשלום.

והארץ יפה.
אפילו אויבים מסביב מקשטים אותה
בנשק מבריק בשמש
כמחרוזת על צוואר.

והארץ ארץ חבילה:
והיא קשורה היטב והכל בה, והיא קשורה חזק
והחוטים לפעמים מכאיבים.

והארץ קטנה מאוד,
ואני יכול להכיל אותה בתוכי,
סחף הקרקע סוחף גם את מנוחתי
ומיפלס הכינרת תמיד בתודעתי.
ולכן אני יכול לחוש אותה כולה
בעצימת עין: ים עמק הר.
ולכן אני יכול לזכור את כל אשר קרה בה
בבת אחת, כאיש שזוכר
את כל חייו ברגע מותו.`
  },
      {
    id: '3',
    title: 'אל מלא רחמים',
    poet: 'יהודה עמיחי',
    content:`
אל מלא רחמים,
אלמלא האל מלא רחמים
היו הרחמים בעולם ולא רק בו.
אני, שקטפתי פרחים בהר
והסתכלתי אל כל העמקים,
אני, שהבאתי גוויות מן הגבעות,
יודע לספר שהעולם ריק מרחמים.

אני שהייתי מלך המלח ליד הים,
שעמדתי בלי החלטה מול חלוני,
שספרתי צעדי מלאכים,
שלבי הרים משקלות כאב
בתחרויות הנוראות.

אני שמשתמש רק בחלק קטן
מן המילים במלון.

אני, שמוכרח לפתור חידות בעל כורחי,
יודע כי אלמלא האל מלא רחמים
היו הרחמים בעולם
ולא רק בו.`
  }
];
