export interface Poem {
  id: string;
  title: string;
  poet: string;
  content: string;  // Full poem text
}

export const poems: Poem[] = [
  // Example format - replace with actual poems
  {
    id: '1',
    title: 'אהבנו כאן',
    poet: 'יהודה עמיחי',
    content:`
            אהבנו כאן
            המציאות היתה אחרת
            העיתונים שוב צעקו כמו פצועים
            מאחורי שורות ענק שבכותרת
            אנחנו שנינו נחבאים

            ברדיו
            נאמרו חדשות הערב
            כל המילים יצאו בלי שיבה
            אנשי הזאבים יצאו לטרף
            אנשי הכאבים אל התקווה

            אנשי המרפקים תפסו מקום
            אנשי האהבה חלמו חלום
            נשות התה בכו לתוך כוסות
            מאחורי ההר חיכו גייסות  

            לא שוחררו ממלחמותיהם
            ולא ישובו עוד לבתיהם`
  },
    {
    id: '2',
    title: 'אהבת הארץ',
    poet: 'יהודה עמיחי',
    content:`
           
והארץ מחולקת למחוזות הזיכרון וגלילי התקווה,
ותושביהם מתערבבים אלה עם אלה,
כמו חוזרים מחתונה עם חוזרים מליווית המת.

והארץ לא מחולקת לשיטחי מילחמה ולשיטחי שלום.
ומי שחופר גומה נגד פגזים,
ישוב וישכב בה עם נערתו,
אם יחיה לשלום.

והארץ יפה.
אפילו אויבים מסביב מקשטים אותה
בנשק מבריק בשמש
כמחרוזת על צוואר.

והארץ ארץ חבילה:
והיא קשורה היטב והכל בה, והיא קשורה חזק
והחוטים לפעמים מכאיבים.

והארץ קטנה מאוד,
ואני יכול להכיל אותה בתוכי,
סחף הקרקע סוחף גם את מנוחתי
ומיפלס הכינרת תמיד בתודעתי.
ולכן אני יכול לחוש אותה כולה
בעצימת עין: ים עמק הר.
ולכן אני יכול לזכור את כל אשר קרה בה
בבת אחת, כאיש שזוכר
את כל חייו ברגע מותו.`
  },
      {
    id: '3',
    title: 'אל מלא רחמים',
    poet: 'יהודה עמיחי',
    content:`
אל מלא רחמים,
אלמלא האל מלא רחמים
היו הרחמים בעולם ולא רק בו.
אני, שקטפתי פרחים בהר
והסתכלתי אל כל העמקים,
אני, שהבאתי גוויות מן הגבעות,
יודע לספר שהעולם ריק מרחמים.

אני שהייתי מלך המלח ליד הים,
שעמדתי בלי החלטה מול חלוני,
שספרתי צעדי מלאכים,
שלבי הרים משקלות כאב
בתחרויות הנוראות.

אני שמשתמש רק בחלק קטן
מן המילים במלון.

אני, שמוכרח לפתור חידות בעל כורחי,
יודע כי אלמלא האל מלא רחמים
היו הרחמים בעולם
ולא רק בו.`
  },
        {
    id: '4',
    title: 'אלוהים מרחם על ילדי הגן',
    poet: 'יהודה עמיחי',
    content:`

אלוהים מרחם על ילדי הגן
פחות מזה על ילדי בית הספר.
ועל הגדולים לא ירחם עוד
ישאירם לבדם
ולפעמים יצטרכו לזחול על ארבע
בחול הלוהט כדי להגיע
אל תחנת האיסוף
והם שותתי דם.

אולי על האוהבים באמת
יתן רחמים ויחוס ויצל
כאילן על הישן בספסל
שבשדרה הצבורית.

אולי להם גם אנחנו נוציא
את מטבעות החסד האחרונות
שהורישה לנו אמא,
כדי שאשרם יגן עלינו
עכשיו ובימים האחרים.`
  },
          {
    id: '5',
    title: 'אלול בעין כרם',
    poet: 'יהודה עמיחי',
    content:`
אלול בעין כרם עננים ראשונים
הדכדוך העמוק של רות עכשיו שוב
חומות ומדרגות מטפסות בלי להגיע
הגפן ריקה ומאושרת

לא למות עכשיו,
ובחוץ גועש שוק סוף הקיץ

אלול בעין כרם עננים ראשונים
לכל היותר אהבה
חומות ומדרגות מטפסות בלי להגיע
הגפן ריקה ומאושרת

לא למות עכשיו,
ובחוץ גועש שוק סוף הקיץ`
  },
{
      id: '6',
    title: 'אמרתי לך שיהיה כך - ולא האמנת',
    poet: 'יהודה עמיחי',
    content:`
ליד הרכבת ראינו שכבות בהר,
זו על זו, קדומות, קשת על קשת,
גם אנחנו נהיה כך, אולי מחר,
יחדיו, צמודים, וגבוה מעל – הדשא.
אמרתי לך שיהיה כך – ולא האמנת.

כל הלילה עמל הירח כמו מטורף
וטשטש ניגודים והרגיע דם ומים.
ילדתי, אין כל הבדל עכשיו,
כדין כל העולם הוא דין השניים.
אמרתי לך שיהיה כך – ולא האמנת.

הפתיליה והסיר שעליה – בנחת
מה אכפת לשניהם, הם זה לזה רוחשים,
גם אנחנו עוד נהיה כך ביחד,
אדומים וחמים ואחד בשני לוחשים.
אמרתי לך שיהיה כך –ולא האמנת.

יש בנו נגינה אך אין בנו די רעם.
מתי סוף-סוף נלמד להיות קשים?
הכפירים, נערה, אינם רעבים אף פעם,
רק צדיקים וכבשים רעבים ורשים.
אמרתי לך שיהיה כך – ולא האמנת.

ראי, אהבתנו עכשיו בלי גבול,
והגענו לגבול שאין בו אהבה.
השומרים אמרו סיסמתם והשער נעול,
הילדים הלכו, החשמל כבה.
אמרתי לך שיהיה כך – ולא האמנת.`
  },

{
      id: '7',
    title: 'אני רוצה למות על מיטתי',
    poet: 'יהודה עמיחי',
    content:`כל הלילה עלה צבא מן הגלגל
להגיע עד שדה הקטל ועד בכלל,
המתים באדמה שכבו בערב ובשתי,
אני רוצה למות על מיטתי.

עיניהם היו צרות כבטנק האשנבים,
אני תמיד מעטים והם רבים,
אני מוכרח לענות, הם יכולים לחקור אותי
אבל, אני רוצה למות על מיטתי.

וואו הם יכולים לחקור אותי
אבל אני רוצה למות על מיטתי

שמשון, גבורתו בשיער ארוך ושחור,
את שלי גזזו כשעשוני לגיבור חובה
ולמדוני לדרוך את קשתי,
אבל אני רוצה למות על מיטתי.

וואו הם יכולים....

ראיתי כי אפשר לגור ולהסתדר
ולרהט גם לוע של אריה, אם אין מקום אחר,
כבר לא אכפת לי למות ביחידותי,
אבל אני רוצה למות על מטתי.

וואו הם יכולים....

כבר לא אכפת לי למות ביחידותי
אבל אני רוצה למות על מיטתי.`
  },
  {
      id: '8',
    title: 'באהבתנו',
    poet: 'יהודה עמיחי',
    content:`
באהבתנו
גוף הפך מקום,
ובזכרוננו
לא תעז לנשום.

מה שלא עשינו,
לילה מתאדה,
מה שלא היינו
הוא עכשיו שדה.

שיכחה ולקט
ופאת עבר,
כי תקוות הטקס
לא תציל דבר.

שיח בוגונוילה,
זמן הופך מקום
בעיני הלילה
יזכר היום,

יזכרו בשקט
בית ומדבר,
כי הטקס
הוא אשר נשאר.`
  },
    {
      id: '9',
    title: 'בבוקר',
    poet: 'יהודה עמיחי',
    content:`
בבוקר אני עומד ליד מיטתך
צילי נופל על פנייך
ומעמיק את שנתך
ועושה לך תוספת לילה.

כאצבעות מעשן
נפשך כהתה
מכורה לאהבה.

אני אוהב אותך
בכל מאודי
ובכל אודי.`
  },
      {
      id: '10',
    title: 'בגן מוקסם',
    poet: 'יהודה עמיחי',
    content:`
בגן מוקסם יושב איש מפוכח,
חציו מואר, חציו שכח.

אמו קראה לו מחלון של שינה,
אך הוא לא ישן ולכן לא פנה,

ויצא לבדו אל מחוץ לגדר,
חציו הוא, חציו אחר.

ואהב סיפור אהבה מפורסם.
ומאז לא שב אל הגן המוקסם.

וחי בטוב וחי בכאב
ואם לא מת הוא עדיין אוהב.`
  },
        {
      id: '11',
    title: 'בודד ציבורי',
    poet: 'יהודה עמיחי',
    content:`
בגינה הציבורית
בודד ציבורי,
מי ועד מי,
הוא עדיין בצל

אך שומעים אותו מצלצל
במחשבותיו
ככלב בשרשרת,
הוא יעבור לאיטו
הוא יאהב אשה אחרת.

ראו את פניו
על רקע ירוק,
מופנות לעולמי עד
לעניין רחוק,
לא יוכל לשמוע,

אך שומעים אותו...`
  },
        {
      id: '12',
    title: 'בטרם',
    poet: 'יהודה עמיחי',
    content:`בטרם השער ייסגר
בטרם כל האמור יאמר,
בטרם אהיה אחר,
בטרם יקריש דם נבון,
בטרם יסגרו הדברים בארון,
בטרם יתקשה הבטון
בטרם יסתמו כל נקבי החלילים
בטרם יוסברו כל הכללים
בטרם ישברו את הכלים,
בטרם החוק יכנס לתוקפו,
בטרם אלוהים יסגור את כפו
בטרם נלך מפה.`
  },
        {
      id: '13',
    title: 'בלילות אני מונחת על פניך',
    poet: 'יהודה עמיחי',
    content:`

בַּלֵּילוֹת אֲנִי
מֻנַּחַת עַל פָּנֶיךָ.

עַל עַרְבוֹת גּוּפְךָ
אֶטַּע עֲצֵי אֶרֶז וְשָׁקֵד.

לֹא אַלְאֶה לַחְפֹּר בְּתוֹךְ חָזְךָ
לִמְצֹא תַּעֲנוּגוֹת הַזָּהָב שֶׁל פַּרְעֹה.

אֲבָל שִׂפְתוֹתֶיךָ כָּבְדוּ
נִסַּי לֹא יִגְאֲלוּ אוֹתָן.

הָרֵם נָא אֶת שְׁמֵי שְׁלָגֶיךָ
מֵעַל נַפְשִׁי.

חֲלוֹמוֹת הַיַּהֲלוֹם שֶׁלְּךָ
פּוֹתְחִים אֶת עוֹרְקַי.

אֲנִי יוֹסֵף חָגוּר אַבְנֵט מָתוֹק
עַל עוֹר הַפַּסִּים שֶׁלִּי.

הָרַחַשׁ הַנִּפְעָם שֶׁל צְדָפַי
עוֹשֶׂה אוֹתְךָ לִמְאֻשָּׁר.

אַךְ לִבְּךָ לֹא יִתֵּן עוֹד לַמַּיִם לַחְדֹּר אֵלָיו.
הוֹ, אַתָּה.`
  },
        {
      id: '14',
    title: 'גשם בשדה קרב',
    poet: 'יהודה עמיחי',
    content:`
גשם יורד על פני רעי
על פני רעי החיים אשר
מכסים ראשיהם בשמיכה
ועל פני רעי המתים אשר
אינם מכסים עוד.`
  },
        {
      id: '15',
    title: 'גשם יורד',
    poet: 'יהודה עמיחי',
    content:`
גשם יורד על פני רעי
על פני רעי החיים
אשר מכסים ראשיהם בשמיכה
ועל פני רעי המתים
אשר אינם מכסים עוד

גשם יורד על פני רעי
על פני רעי החיים
אשר מכסים ראשיהם בשמיכה
ועל פני רעי המתים
אשר אינם מכסים עוד

גשם יורד על פני רעי
גשם יורד על פני רעי החיים
גשם יורד על פני רעי`
  },
        {
      id: '16',
    title: 'דרך שתי נקודות',
    poet: 'יהודה עמיחי',
    content:`
כוכב צעיר התחתן עם כוכבה
ובפנים דובר גרמנית על סכנה קרובה.
רציתי להיזכר בזמר וזכרתי רק את המשפט
כי דרך שתי נקודות עובר רק קו ישר אחד.

כלב עזוב רדף אחרינו לאורך הרחוב
צעקתי, ידיתי אבן, ולא רצה לעזוב.
אחר כך אבדנו לו וגם הוא אבד.
דרך שתי נקודות עובר רק קו ישר אחד.

בכייך הקטן מספיק להרבה כאבים,
כמו קטר המושך קרונות רבים
מתי נשוב הביתה? חכי עוד מעט
כי דרך שתי נקודות עובר רק קו ישר אחד.

לפעמים השמש זכר, לפעמים נקבה,
לפעמים אנחנו שניים, לפעמים יותר מרבבה.
לפעמים אינני יודע מי יחזיק אותנו ביד
אבל דרך שתי נקודות עובר רק קו ישר אחד.

חיינו שבכתב היו לחיינו שבעל פה.
חיינו שבעולם הבא לחיינו שבזה.
חיינו הממהרים וחיינו העוברים לאט.
דרך שתי נקודות עובר רק קו ישר אחד.`
  },
        {
      id: '17',
    title: 'הבלדה על השיער הארוך והשיער הקצר',
    poet: 'יהודה עמיחי',
    content:`שיערו גולח כשבא למחנה,
שיערה נשאר ארוך ובלי מענה
"אינני שומע אותך ברעש הגובר".
שיערך הארוך, נערה, שיערך הקצר.

כל הקיץ התאמנו פרחים לפרוח,
בתוך האדמה הסבלנית וצברו כוח.
"חזרתי אלייך. אבל הייתי אחר"
שיערך הארוך, נערה, שיערך הקצר.

הרוח שיברה את העץ, העץ את הרוח
היו להם הרבה אפשרויות ומעט זמן לנוח.
"הגשם יורד, בוא הביתה מהר".
שיערך הארוך, נערה, שיערך הקצר.

העולם היה להם, כדיבור לא-ישיר,
לא נוגע בהם. לאט החלו לשיר.
כיוונתי שעוני."מתי אתה חוזר?"
שיערך הארוך, נערה, שיערך הקצר.

אחר כך שתקו, כצעדים מתרחקים.
השמים נפתחו. נסגרו ספרי החוקים,
"מה את אומרת?", "מה אתה אומר?"
שיערך הארוך, נערה, שיערך הקצר.`
  },
        {
      id: '18',
    title: 'ההתמוטטויות המתוקות של אביגיל',
    poet: 'יהודה עמיחי',
    content:`מכות קטנות מכים אותה, כמו ביצה לקילוף.
מכות בושם נואשות היא מחזירה לעולם.
בציחקוקים חדים היא מתנקמת על כל העצבות,
ובהתאהבויות פזיזות.

בלילה כשהיא קורעת תכשיטיה,
יש סכנה שלא תדע גבול,
והיא תמשיך לקרוע את חייה -
ההתמוטטויות המתוקות של אביגייל.`
  },
        {
      id: '19',
    title: 'היי שלום',
    poet: 'יהודה עמיחי',
    content:`היי שלום, פני את וכבר אין זכר.
נדוד עולה מאוב ועף ועף.
פני חיות, פני מים ופני לכת,
ויער לחישות, פני חיק, פני טף.

לא לנו שוב שעה שבה נוכל לגשת,
לא לנו להגיד: עכשיו, עכשיו.
שם של רוחות היה לך, פעם אשת
הכיוונים וכוונות מראה וסתו.

כי מה שלא הבנו, הן זימרנו יחד.
דורות וחושך, פני הסרוגין.
ולא שלי עוד, לא מפוענחת,
סגורת פטמות, אבזם, פיות, ברגים.

לכן שלום לך, לעולם לא נירדמת,
שהכל היה בדברנו, שהכל של חול.
מכאן ולהבא את מחלמת
לחלומות שלך: תבל וכל.

היי שלום, צרורות ומיזוודות המוות.
חוטים, נוצות, בליל מישכן, משכון שיער.
כי מה שלא יהיה, אף יד אינה כותבת,
ומה שלא היה של גוף, לא יזכר.`
  },
          {
      id: '20',
    title: 'היינו קרובים',
    poet: 'יהודה עמיחי',
    content:`היינו קרובים זה לזה
כמו שני מספרים בהגרלה
בהפרש קטן של ספרה אחת
ואחד מהם יזכה, אולי

ויפים פניך ושמך המודפסים עליך
כמו על קופסה של מעדן מופלא
הפרי והשם,
האם את עדיין בפנים

בימים שבהם
הימים יהיו
מתוקים כלילות ויפים בזמני האנשים
שהזמן אינו חשוב להם עוד
נדע, נדע`
  }
];
